---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DemandFlow
source: html/eaba9409-603d-7e3e-71cc-436415d408a5.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.DemandFlow Property

The designed flow value, in ft^3/s.

## Syntax (C#)
```csharp
public double DemandFlow { get; }
```